## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 19 to add, 5 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                     NAME                                                      |
|----------|---------------------------------------------------------------------------------------------------------------|
| add      | `aws_acm_certificate.form_viewer_maintenance_mode`                                                            |
|          | `aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate`                          |
|          | `aws_cloudfront_distribution.maintenance_mode`                                                                |
|          | `aws_cloudfront_origin_access_identity.maintenance_mode`                                                      |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.canada.ca&quot;]`                        |
|          | `aws_route53_record.form_viewer_maintenance[0]`                                                               |
|          | `aws_route53_record.form_viewer_maintenance[1]`                                                               |
|          | `aws_route53_record.form_viewer_maintenance_mode_certificate_validation[&quot;forms-formulaires.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.form_viewer_maintenance_mode_certificate_validation[&quot;forms-formulaires.canada.ca&quot;]`       |
|          | `aws_s3_bucket.maintenance_mode`                                                                              |
|          | `aws_s3_bucket_acl.maintenance_mode`                                                                          |
|          | `aws_s3_bucket_object.maintenance_static_page`                                                                |
|          | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3`                                        |
|          | `aws_s3_bucket_public_access_block.maintenance_mode`                                                          |
|          | `aws_s3_bucket_server_side_encryption_configuration.maintenance_mode`                                         |
|          | `aws_s3_bucket_website_configuration.maintenance_mode`                                                        |
|          | `aws_wafv2_web_acl.forms_maintenance_mode_acl`                                                                |
| update   | `aws_lb_listener.form_viewer_https`                                                                           |
|          | `aws_lb_target_group.form_viewer_1`                                                                           |
|          | `aws_lb_target_group.form_viewer_2`                                                                           |
|          | `aws_route53_record.form_viewer[0]`                                                                           |
|          | `aws_route53_record.form_viewer[1]`                                                                           |
| recreate | `aws_acm_certificate.form_viewer`                                                                             |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.alpha.canada.ca&quot;]`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.form_viewer must be replaced
+/- resource "aws_acm_certificate" "form_viewer" {
      ~ arn                       = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "forms-formulaires.alpha.canada.ca"
              - resource_record_name  = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6ea0e0b39a687d606d774852492fb7c2.nfyddsqlcy.acm-validations.aws."
            },
          + {
              + domain_name           = "forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-formulaires.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "forms-formulaires.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ validation_emails         = [] -> (known after apply)
        # (3 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.form_viewer_maintenance_mode will be created
  + resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
      + arn                       = (known after apply)
      + domain_name               = "forms-formulaires.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-formulaires.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "forms-formulaires.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate will be created
  + resource "aws_acm_certificate_validation" "form_viewer_maintenance_mode_cloudfront_certificate" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.maintenance_mode will be created
  + resource "aws_cloudfront_distribution" "maintenance_mode" {
      + aliases                        = [
          + "forms-formulaires.alpha.canada.ca",
          + "forms-formulaires.canada.ca",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "MaintenanceMode"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "MaintenanceMode"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2019"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.maintenance_mode will be created
  + resource "aws_cloudfront_origin_access_identity" "maintenance_mode" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Access Identity for the Maintenance Website"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener/app/form-viewer/ef2ad28d416e7d87/6cbbf9263c624fe9"
        tags              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.form_viewer_1 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_1" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer/8dac72758c8ecdcc"
        name                               = "form-viewer"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Name"       = "form_viewer_1"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.form_viewer_2 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_2" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer-2/a03ac97959b5fb63"
        name                               = "form-viewer-2"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Name"       = "form_viewer_2"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
        id             = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A"
        name           = "forms-formulaires.alpha.canada.ca"
      + set_identifier = "form_viewer_forms-formulaires.alpha.canada.ca_primary"
        # (5 unchanged attributes hidden)

      + failover_routing_policy {
          + type = "PRIMARY"
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[1] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
        id             = "Z0774184336K3QX9DUJ7E_forms-formulaires.canada.ca_A"
        name           = "forms-formulaires.canada.ca"
      + set_identifier = "form_viewer_forms-formulaires.canada.ca_primary"
        # (5 unchanged attributes hidden)

      + failover_routing_policy {
          + type = "PRIMARY"
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "form_viewer_certificate_validation" {
      ~ fqdn            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z1031499PBK3926Y7HKK__d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca._CNAME" -> (known after apply)
      ~ name            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca" # forces replacement -> (known after apply)
      ~ records         = [
          - "_6ea0e0b39a687d606d774852492fb7c2.nfyddsqlcy.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0774184336K3QX9DUJ7E"
    }

  # aws_route53_record.form_viewer_maintenance[0] will be created
  + resource "aws_route53_record" "form_viewer_maintenance" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.alpha.canada.ca"
      + set_identifier  = "form_viewer_forms-formulaires.alpha.canada.ca_secondary"
      + type            = "A"
      + zone_id         = "Z1031499PBK3926Y7HKK"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + failover_routing_policy {
          + type = "SECONDARY"
        }
    }

  # aws_route53_record.form_viewer_maintenance[1] will be created
  + resource "aws_route53_record" "form_viewer_maintenance" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.canada.ca"
      + set_identifier  = "form_viewer_forms-formulaires.canada.ca_secondary"
      + type            = "A"
      + zone_id         = "Z0774184336K3QX9DUJ7E"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + failover_routing_policy {
          + type = "SECONDARY"
        }
    }

  # aws_route53_record.form_viewer_maintenance_mode_certificate_validation["forms-formulaires.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_route53_record.form_viewer_maintenance_mode_certificate_validation["forms-formulaires.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0774184336K3QX9DUJ7E"
    }

  # aws_s3_bucket.maintenance_mode will be created
  + resource "aws_s3_bucket" "maintenance_mode" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "gc-forms-application-maintenance-page"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.maintenance_mode will be created
  + resource "aws_s3_bucket_acl" "maintenance_mode" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "71d937b0c2975a347679a6b9ea8fa628"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.maintenance_mode will be created
  + resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_wafv2_web_acl.forms_maintenance_mode_acl will be created
  + resource "aws_wafv2_web_acl" "forms_maintenance_mode_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "GCFormsMaintenanceMode"
      + scope      = "CLOUDFRONT"
      + tags       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowGetRequestOnRootOnly"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "GET"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "/"

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AllowGetRequestOnRootOnly"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "forms_maintenance_mode_global_rule"
          + sampled_requests_enabled   = false
        }
    }

Plan: 19 to add, 5 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
